Documents/АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АктСверкиВзаиморасчетов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверкаСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расхождение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиВВалюте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
			<Comment>Взаиморасчеты с контрагентами в валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/АктСверкиВзаиморасчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();

	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	ИзменитьДоступностьПоСогласованиюСверки(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоДаннымУчета(Команда)
	
	Если Объект.ПоДаннымОрганизации.Количество() > 0 Тогда		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьПоДаннымУчетаЗавершение", ЭтотОбъект);
		Текст = НСтр("ru='Перед заполнением табличная часть будет очищена. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);		
	Иначе		
		ЗаполнитьПоДаннымУчетаСервер();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеКонтрагентаПоДаннымОрганизации(Команда)
	
	Если Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаполнитьДанныеКонтрагентаЗавершение", ЭтотОбъект);
		Текст = НСтр("ru='Перед заполнением табличная часть будет очищена. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
	Иначе
		
		ЗаполнитьДанныеКонтрагентаПоДаннымОрганизацииСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)	
	ПриИзмененииПериода();	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)	
	ПриИзмененииПериода();	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Проверяем: нужно ли что-то обновлять:
	Если НЕ Объект.Организация = ТекущаяОрганизация Тогда
		
		Если Объект.ПоДаннымОрганизации.Количество() > 0 ИЛИ Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииОрганизацииЗавершение", ЭтотОбъект);
			Текст = НСтр("ru = 'При изменении организации табличные части будут очищены. Продолжить?'");
			ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
			
		Иначе
			// Отработку изменения передаем на сервер:
			ПриИзмененииОрганизацииСервер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Проверяем: нужно ли что-то обновлять:
	Если НЕ Объект.Контрагент = ТекущийКонтрагент Тогда
		
		Если Объект.ПоДаннымОрганизации.Количество() > 0 ИЛИ Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииКонтрагентаЗавершение", ЭтотОбъект);
			Текст = НСтр("ru='При изменении контрагента табличные части будут очищены. Продолжить?'");
			ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
			
		Иначе
			// Отработку изменения передаем на сервер:
			ПриИзмененииКонтрагентаСервер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	// Проверяем: нужно ли что-то обновлять:
	Если НЕ Объект.ДоговорКонтрагента = ТекущийДоговор Тогда
		
		Если Объект.ПоДаннымОрганизации.Количество() > 0 ИЛИ Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииДоговораЗавершение", ЭтотОбъект);
			Текст = НСтр("ru='При изменении договора табличные части будут очищены. Продолжить?'");
			ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
			
		Иначе
			// Отработку изменения передаем на сервер:
			ПриИзмененииДоговораСервер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаСогласованаПриИзменении(Элемент)
	
	ИзменитьДоступностьПоСогласованиюСверки(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийТаблицыФормыПоДаннымКонтрагента

&НаКлиенте
Процедура ПоДаннымОрганизацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ПересчитатьОстатки(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымОрганизацииПослеУдаления(Элемент)
	
	ПересчитатьОстатки(ЭтотОбъект);
	
КонецПроцедуры

#Область ОбработчикиСобытийТаблицыФормыПоДаннымКонтрагента

&НаКлиенте
Процедура ПоДаннымКонтрагентаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ПересчитатьОстатки(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымКонтрагентаПослеУдаления(Элемент)
	
	ПересчитатьОстатки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ДоговорКонтрагента.Доступность = ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьДоступностьПоСогласованиюСверки(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.Организация.Доступность                         = НЕ Объект.СверкаСогласована;
	Элементы.Контрагент.Доступность                          = НЕ Объект.СверкаСогласована;
	Элементы.ДоговорКонтрагента.Доступность                          = НЕ Объект.СверкаСогласована;
	Элементы.ВалютаДокумента.Доступность                     = НЕ Объект.СверкаСогласована;
	Элементы.ГруппаПериодСверки.Доступность                  = НЕ Объект.СверкаСогласована;
	Элементы.ПоДаннымКонтрагента.ТолькоПросмотр              = Объект.СверкаСогласована;
	Элементы.ПоДаннымОрганизации.ТолькоПросмотр              = Объект.СверкаСогласована;
	Элементы.ПоДаннымКонтрагента.КоманднаяПанель.Доступность = НЕ Объект.СверкаСогласована;
	Элементы.ПоДаннымОрганизации.КоманднаяПанель.Доступность = НЕ Объект.СверкаСогласована;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ПересчитатьОстатки(ЭтотОбъект);
	ЗапомнитьТекущиеЗначенияРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьТекущиеЗначенияРеквизитов()
	
	ТекущаяОрганизация              = Объект.Организация;
	ТекущийКонтрагент               = Объект.Контрагент;
	ТекущийПредставительКонтрагента = Объект.ПредставительКонтрагента;
	ТекущийПериод.ДатаНачала        = Объект.ДатаНачала;
	ТекущийПериод.ДатаОкончания     = Объект.ДатаОкончания;
	ТекущийДоговор 					= Объект.ДоговорКонтрагента;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьОстатки(Форма)

	Объект = Форма.Объект;
	
	Форма.ОстатокНаКонец = Объект.ОстатокНаНачало
		+ Объект.ПоДаннымОрганизации.Итог("Дебет")
		- Объект.ПоДаннымОрганизации.Итог("Кредит");
		
	Форма.ОстатокНаНачалоКонтрагент = - Объект.ОстатокНаНачало;
	Форма.ОстатокНаКонецКонтрагент = Форма.ОстатокНаНачалоКонтрагент
		+ Объект.ПоДаннымКонтрагента.Итог("Дебет")
		- Объект.ПоДаннымКонтрагента.Итог("Кредит");
	
	Объект.Расхождение = Форма.ОстатокНаКонец + Форма.ОстатокНаКонецКонтрагент;
	Форма.РасхождениеКонтрагент = - Объект.Расхождение;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеРеквизитов

&НаСервере
Процедура ПриИзмененииОрганизацииСервер()
	
	ТекущаяОрганизация = Объект.Организация;
	Объект.ПредставительОрганизации = ПредставительОрганизации(Объект.Организация);
	
	ОбработатьСвязанныеРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтрагентаСервер()
	
	ТекущийКонтрагент = Объект.Контрагент;
	
	//Объект.ПредставительКонтрагента = 
	//	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийКонтрагент, "ОсновноеКонтактноеЛицо");
	ТекущийПредставительКонтрагента = Объект.ПредставительКонтрагента;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
	КонецЕсли;
	
	ОбработатьСвязанныеРеквизиты();
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьСвязанныеРеквизиты()
	
	// очищаем табличные части документа
	ОчиститьДанные(ЭтотОбъект);	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДоговораСервер()

	// Обновим текущее значение:
	ТекущийДоговор = Объект.ДоговорКонтрагента;
	
	// очищаем табличные части документа:
	ОчиститьДанные(ЭтотОбъект);
		
	// Изменяем видимость/доступность реквизитов:
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	Если (ТекущийПериод.ДатаНачала <> Объект.ДатаНачала
		ИЛИ ТекущийПериод.ДатаОкончания <> КонецДня(Объект.ДатаОкончания))
		И Объект.ПоДаннымОрганизации.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииПериодаЗавершение", ЭтотОбъект);
		Текст = НСтр("ru='При изменении периода сверки табличная часть будет очищена. Изменить период?'");
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
	Иначе
		Объект.ОстатокНаНачало = 0;
		ПересчитатьОстатки(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьДанные(Форма)
	
	Объект = Форма.Объект;
	
	Объект.ОстатокНаНачало = 0;
	Объект.ПоДаннымОрганизации.Очистить();
	Объект.ПоДаннымКонтрагента.Очистить();
	ПересчитатьОстатки(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

&НаСервере
Функция ОстатокВзаиморасчетов()
	
	Отбор = Новый Структура("Организация, Контрагент, Валюта", Объект.Организация, Объект.Контрагент, Объект.ВалютаДокумента);
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда	
		Отбор = Новый Структура("Организация, Контрагент, Договор, Валюта", Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента, Объект.ВалютаДокумента);
	КонецЕсли;
	
	ТекущийДолг = РегистрыНакопления.ВзаиморасчетыСКонтрагентамиВВалюте.Остатки(Объект.ДатаНачала,
					Отбор, "Организация, Контрагент, Договор, Валюта", "Сумма").Итог("Сумма");
	Возврат ТекущийДолг;
КонецФункции

//// Заполнение таблицы "По данным организации" по информации из учета.
&НаСервере
Процедура ЗаполнитьПоДаннымУчетаСервер()
	
	// проверим заполненность обязательных реквизитов
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОстатокНаНачало = ОстатокВзаиморасчетов();
	
	ТекстФильтра = "
	|		Организация = &Организация И Контрагент = &Контрагент И Валюта = &Валюта ";
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ТекстФильтра = ТекстФильтра + " И Договор = &ДоговорКонтрагента ";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Взаиморасчеты.Период КАК Дата,
	|	Взаиморасчеты.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА Взаиморасчеты.СуммаПриход - Взаиморасчеты.СуммаРасход > 0
	|			ТОГДА Взаиморасчеты.СуммаПриход - Взаиморасчеты.СуммаРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Дебет,
	|	ВЫБОР
	|		КОГДА Взаиморасчеты.СуммаПриход - Взаиморасчеты.СуммаРасход < 0
	|			ТОГДА -(Взаиморасчеты.СуммаПриход - Взаиморасчеты.СуммаРасход)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кредит
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиВВалюте.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, //ТекстФильтра 
	|) КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.СуммаПриход <> Взаиморасчеты.СуммаРасход
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТекстФильтра", ТекстФильтра);
	
	Запрос.УстановитьПараметр("ДатаНачала",         Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",      КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",        Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент",         Объект.Контрагент);
	Запрос.УстановитьПараметр("Валюта",             Объект.ВалютаДокумента);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПоДаннымОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		НоваяСтрока.Представление = Строка(Выборка.Документ);
	КонецЦикла; 
	
	ПересчитатьОстатки(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКонтрагентаПоДаннымОрганизацииСервер()
	
	ПоДаннымКонтрагента = Объект.ПоДаннымОрганизации.Выгрузить();
	
	ПоДаннымКонтрагента.Колонки.Дебет.Имя  = "КредитК";
	ПоДаннымКонтрагента.Колонки.Кредит.Имя = "Дебет";
	ПоДаннымКонтрагента.Колонки.КредитК.Имя= "Кредит";
		
	Объект.ПоДаннымКонтрагента.Загрузить(ПоДаннымКонтрагента);
	ПересчитатьОстатки(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставительОрганизации(Знач Организация)
	
	Возврат Документы.АктСверкиВзаиморасчетов.ПредставительОрганизации(Организация);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОписанияОповещения

&НаКлиенте
Процедура ВопросЗаполнитьПоДаннымУчетаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ПоДаннымОрганизации.Очистить();
		ЗаполнитьПоДаннымУчетаСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьДанныеКонтрагентаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		// проверим заполненность обязательных реквизитов:
		Если Объект.ПоДаннымОрганизации.Количество() = 0 Тогда
			ПоказатьПредупреждение(,НСтр("ru='Таблица ""По данным организации"" не заполнена.'"));
			ТекущийЭлемент = Элементы.ПоДаннымОрганизации;
		Иначе
			ЗаполнитьДанныеКонтрагентаПоДаннымОрганизацииСервер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииОрганизацииЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		// при отказе возвращаем предыдущие значения реквизитов:
		Объект.Организация = ТекущаяОрганизация;
		Объект.ДоговорКонтрагента = ТекущийДоговор;
	Иначе
		// Отработку изменения передаем на сервер:
		ПриИзмененииОрганизацииСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииКонтрагентаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		// при отказе возвращаем предыдущие значения реквизитов:
		Объект.Контрагент = ТекущийКонтрагент;
		Объект.ДоговорКонтрагента = ТекущийДоговор;
		Объект.ПредставительКонтрагента = ТекущийПредставительКонтрагента;
	Иначе
		// Отработку изменения передаем на сервер:
		ПриИзмененииКонтрагентаСервер();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииДоговораЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		// при отказе возвращаем предыдущие значения реквизитов:
		Объект.Организация = ТекущаяОрганизация;
		Объект.ДоговорКонтрагента = ТекущийДоговор;
	Иначе
		// Отработку изменения передаем на сервер:
		ПриИзмененииДоговораСервер();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииПериодаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТекущийПериод.ДатаНачала    = Объект.ДатаНачала;
		ТекущийПериод.ДатаОкончания = Объект.ДатаОкончания;
		ОчиститьДанные(ЭтотОбъект);
	Иначе
		Объект.ДатаНачала    = ТекущийПериод.ДатаНачала;
		Объект.ДатаОкончания = ТекущийПериод.ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
